# Hапишіть программу "Касир в кінотеатрі", яка буде виконувати наступне:
# Попросіть користувача ввести свсвій вік.
# - якщо користувачу менше 7 - вивести "Тобі ж <>! Де твої батьки?"
# - якщо користувачу менше 16 - вивести "Тобі лише <>, а це е фільм для дорослих!"
# - якщо користувачу більше 65 - вивести "Вам <>? Покажіть пенсійне посвідчення!"
# - якщо вік користувача містить 7 - вивести "Вам <>, вам пощастить"
# - у будь-якому іншому випадку - вивести "Незважаючи на те, що вам <>, білетів всеодно нема!"
# Замість <> в кожну відповідь підставте значення віку (цифру) та правильну форму слова рік
# Для будь-якої відповіді форма слова "рік" має відповідати значенню віку користувача (1 - рік, 22 - роки, 35 - років і тд...).
# Наприклад :
# "Тобі ж 5 років! Де твої батьки?"
# "Вам 81 рік? Покажіть пенсійне посвідчення!"
# "Незважаючи на те, що вам 42 роки, білетів всеодно нема!"
# Зробіть все за допомогою функцій! Не забувайте що кожна функція має виконувати тільки одне завдання і про правила написання коду.

ending1 = ["2", "3", "4"] # роки
ending2 = ["11", "12", "13", "14"] # років


def check_if_int():
    while True:
        try:
            userinput = int(input("Введіть Ваш вік: "))
        except:
            print("Невірні дані")
        else:
            break
    return userinput


user_input = check_if_int()


def text_function():
    if user_input in ending2:
        text = "років"
    elif str(user_input)[-1] == "1":
        text = "рік"
    elif str(user_input)[-1] in ending1:
        text = "роки"
    else:
        text = "років"
    return text


def age_function(age):
    if user_input < 7:
        print(f"Тобі ж {age} {text_function()}! Де твої батьки?")
    elif user_input < 16:
        print(f"Тобі лише {age} {text_function()}, а це фільм для дорослих!")
    elif user_input > 65:
        print(f"Вам {age} {text_function()}? Покажіть пенсійне посвідчення!")
    elif "7" in str(age):
        print(f"Вам {age} {text_function()}, вам пощастить")
    else:
        print(f"Незважаючи на те, що вам {age} {text_function()}, білетів всеодно нема!")
    return age


age_function(user_input)




